betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dma.h
                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetPeriphIncMode(). */

  uint32_t MemoryOrM2MDstIncMode;  /*!< Specifies whether the Memory address or Destination address in case of memory to memory transfer direction
                                        is incremented or not.
                                        This parameter can be a value of @ref DMA_DDL_EC_MEMORY

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetMemoryIncMode(). */

  uint32_t PeriphOrM2MSrcDataSize; /*!< Specifies the Peripheral data size alignment or Source data size alignment (byte, half word, word)
                                        in case of memory to memory transfer direction.
                                        This parameter can be a value of @ref DMA_DDL_EC_PDATAALIGN

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetPeriphSize(). */

  uint32_t MemoryOrM2MDstDataSize; /*!< Specifies the Memory data size alignment or Destination data size alignment (byte, half word, word)
                                        in case of memory to memory transfer direction.
                                        This parameter can be a value of @ref DMA_DDL_EC_MDATAALIGN

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetMemorySize(). */

  uint32_t NbData;                 /*!< Specifies the number of data to transfer, in data unit.
                                        The data unit is equal to the source buffer configuration set in PeripheralSize
                                        or MemorySize parameters depending in the transfer direction.
                                        This parameter must be a value between Min_Data = 0 and Max_Data = 0x0000FFFF

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetDataLength(). */

  uint32_t Priority;               /*!< Specifies the channel priority level.
                                        This parameter can be a value of @ref DMA_DDL_EC_PRIORITY

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetStreamPriorityLevel(). */

#if defined (APM32F405xx) || defined (APM32F407xx) || defined (APM32F415xx) || defined (APM32F417xx) || defined (APM32F411xx) || defined (APM32F465xx) || \
    defined (APM32F423xx) || defined (APM32F425xx) || defined (APM32F427xx)
  uint32_t Channel;                /*!< Specifies the peripheral channel.
                                        This parameter can be a value of @ref DMA_DDL_EC_CHANNEL

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetChannelSelection(). */

  uint32_t FIFOMode;               /*!< Specifies if the FIFO mode or Direct mode will be used for the specified stream.
                                        This parameter can be a value of @ref DMA_DDL_FIFOMODE
                                        @note The Direct mode (FIFO mode disabled) cannot be used if the
                                        memory-to-memory data transfer is configured on the selected stream

                                        This feature can be modified afterwards using unitary functions @ref DDL_DMA_EnableFifoMode() or @ref DDL_DMA_EnableFifoMode() . */

  uint32_t FIFOThreshold;          /*!< Specifies the FIFO threshold level.
                                        This parameter can be a value of @ref DMA_DDL_EC_FIFOTHRESHOLD

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetFIFOThreshold(). */

  uint32_t MemBurst;               /*!< Specifies the Burst transfer configuration for the memory transfers.
                                        It specifies the amount of data to be transferred in a single non interruptible
                                        transaction.
                                        This parameter can be a value of @ref DMA_DDL_EC_MBURST
                                        @note The burst mode is possible only if the address Increment mode is enabled.

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetMemoryBurstxfer(). */

  uint32_t PeriphBurst;            /*!< Specifies the Burst transfer configuration for the peripheral transfers.
                                        It specifies the amount of data to be transferred in a single non interruptible
                                        transaction.
                                        This parameter can be a value of @ref DMA_DDL_EC_PBURST
                                        @note The burst mode is possible only if the address Increment mode is enabled.

                                        This feature can be modified afterwards using unitary function @ref DDL_DMA_SetPeriphBurstxfer(). */
#endif /* APM32F405xx || APM32F407xx || APM32F415xx || APM32F417xx || APM32F411xx || APM32F465xx || APM32F423xx || APM32F425xx || APM32F427xx */
} DDL_DMA_InitTypeDef;
/**
  * @}
  */
#endif /*USE_FULL_DDL_DRIVER*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup DMA_DDL_Exported_Constants DMA Exported Constants
  * @{
  */

/** @defgroup DMA_DDL_EC_STREAM STREAM
  * @{
  */
#if defined (DMA1_Stream0)
#define DDL_DMA_STREAM_0                   0x00000000U
#define DDL_DMA_STREAM_1                   0x00000001U
#define DDL_DMA_STREAM_2                   0x00000002U
#define DDL_DMA_STREAM_3                   0x00000003U
#define DDL_DMA_STREAM_4                   0x00000004U
#define DDL_DMA_STREAM_5                   0x00000005U
#define DDL_DMA_STREAM_6                   0x00000006U
#define DDL_DMA_STREAM_7                   0x00000007U
#define DDL_DMA_STREAM_ALL                 0xFFFF0000U
#else
#define DDL_DMA_CHANNEL_1                  0x00000001U
#define DDL_DMA_CHANNEL_2                  0x00000002U
#define DDL_DMA_CHANNEL_3                  0x00000003U
#define DDL_DMA_CHANNEL_4                  0x00000004U
#define DDL_DMA_CHANNEL_5                  0x00000005U
#define DDL_DMA_CHANNEL_6                  0x00000006U
#define DDL_DMA_CHANNEL_7                  0x00000007U
#define DDL_DMA_CHANNEL_ALL                0xFFFF0000U
#endif /* DMA1_Stream0 */

/**
  * @}
  */

/** @defgroup DMA_DDL_EC_DIRECTION DIRECTION
  * @{
  */
#define DDL_DMA_DIRECTION_PERIPH_TO_MEMORY 0x00000000U                   /*!< Peripheral to memory direction */
#if defined (DMA_SCFGx_DIRCFG)
#define DDL_DMA_DIRECTION_MEMORY_TO_PERIPH DMA_SCFGx_DIRCFG_0            /*!< Memory to peripheral direction */
#define DDL_DMA_DIRECTION_MEMORY_TO_MEMORY DMA_SCFGx_DIRCFG_1            /*!< Memory to memory direction     */
#else
#define DDL_DMA_DIRECTION_MEMORY_TO_PERIPH DMA_CHCFG_DIRCFG              /*!< Memory to peripheral direction */
#define DDL_DMA_DIRECTION_MEMORY_TO_MEMORY DMA_CHCFG_M2MMODE             /*!< Memory to memory direction     */
#endif /* DMA_SCFGx_DIRCFG */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_MODE MODE
  * @{
  */
#define DDL_DMA_MODE_NORMAL                0x00000000U               /*!< Normal Mode                  */
#if defined (DMA_SCFGx_PERFC)
#define DDL_DMA_MODE_CIRCULAR              DMA_SCFGx_CIRCMEN         /*!< Circular Mode                */
#define DDL_DMA_MODE_PFCTRL                DMA_SCFGx_PERFC           /*!< Peripheral flow control mode */
#else
#define DDL_DMA_MODE_CIRCULAR              DMA_CHCFG_CIRMODE         /*!< Circular Mode                */
#endif /* DMA_SCFGx_PERFC */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_DOUBLEBUFFER_MODE DOUBLEBUFFER MODE
  * @{
  */
#define DDL_DMA_DOUBLEBUFFER_MODE_DISABLE  0x00000000U                /*!< Disable double buffering mode */
#define DDL_DMA_DOUBLEBUFFER_MODE_ENABLE   DMA_SCFGx_DBM              /*!< Enable double buffering mode  */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_PERIPH PERIPH
  * @{
  */
#define DDL_DMA_PERIPH_NOINCREMENT         0x00000000U                 /*!< Peripheral increment mode Disable */
#if defined (DMA_SCFGx_PERIM)
#define DDL_DMA_PERIPH_INCREMENT           DMA_SCFGx_PERIM             /*!< Peripheral increment mode Enable  */
#else
#define DDL_DMA_PERIPH_INCREMENT           DMA_CHCFG_PERIMODE          /*!< Peripheral increment mode Enable  */
#endif /* DMA_SCFGx_PERIM */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_MEMORY MEMORY
  * @{
  */
#define DDL_DMA_MEMORY_NOINCREMENT         0x00000000U                 /*!< Memory increment mode Disable */
#if defined (DMA_SCFGx_MEMIM)
#define DDL_DMA_MEMORY_INCREMENT           DMA_SCFGx_MEMIM             /*!< Memory increment mode Enable  */
#else
#define DDL_DMA_MEMORY_INCREMENT           DMA_CHCFG_MIMODE            /*!< Memory increment mode Enable  */
#endif /* DMA_SCFGx_MEMIM */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_PDATAALIGN PDATAALIGN
  * @{
  */
#define DDL_DMA_PDATAALIGN_BYTE            0x00000000U                     /*!< Peripheral data alignment : Byte     */
#if defined (DMA_SCFGx_PERSIZECFG)
#define DDL_DMA_PDATAALIGN_HALFWORD        DMA_SCFGx_PERSIZECFG_0          /*!< Peripheral data alignment : HalfWord */
#define DDL_DMA_PDATAALIGN_WORD            DMA_SCFGx_PERSIZECFG_1          /*!< Peripheral data alignment : Word     */
#else
#define DDL_DMA_PDATAALIGN_HALFWORD        DMA_CHCFG_PERSIZE_0             /*!< Peripheral data alignment : HalfWord */
#define DDL_DMA_PDATAALIGN_WORD            DMA_CHCFG_PERSIZE_1             /*!< Peripheral data alignment : Word     */
#endif /* DMA_SCFGx_PERSIZECFG */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_MDATAALIGN MDATAALIGN
  * @{
  */
#define DDL_DMA_MDATAALIGN_BYTE            0x00000000U                     /*!< Memory data alignment : Byte     */
#if defined (DMA_SCFGx_MEMSIZECFG)
#define DDL_DMA_MDATAALIGN_HALFWORD        DMA_SCFGx_MEMSIZECFG_0          /*!< Memory data alignment : HalfWord */
#define DDL_DMA_MDATAALIGN_WORD            DMA_SCFGx_MEMSIZECFG_1          /*!< Memory data alignment : Word     */
#else
#define DDL_DMA_MDATAALIGN_HALFWORD        DMA_CHCFG_MEMSIZE_0             /*!< Memory data alignment : HalfWord */
#define DDL_DMA_MDATAALIGN_WORD            DMA_CHCFG_MEMSIZE_1             /*!< Memory data alignment : Word     */
#endif /* DMA_SCFGx_MEMSIZECFG */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_OFFSETSIZE OFFSETSIZE
  * @{
  */
#if defined (DMA_SCFGx_PERIOSIZE)
#define DDL_DMA_OFFSETSIZE_PSIZE           0x00000000U                   /*!< Peripheral increment offset size is linked to the PSIZE */
#define DDL_DMA_OFFSETSIZE_FIXEDTO4        DMA_SCFGx_PERIOSIZE           /*!< Peripheral increment offset size is fixed to 4 (32-bit alignment) */
#endif /* DMA_SCFGx_PERIOSIZE */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_PRIORITY PRIORITY
  * @{
  */
#define DDL_DMA_PRIORITY_LOW               0x00000000U                     /*!< Priority level : Low       */
#if defined (DMA_SCFGx_PRILCFG)
#define DDL_DMA_PRIORITY_MEDIUM            DMA_SCFGx_PRILCFG_0             /*!< Priority level : Medium    */
#define DDL_DMA_PRIORITY_HIGH              DMA_SCFGx_PRILCFG_1             /*!< Priority level : High      */
#define DDL_DMA_PRIORITY_VERYHIGH          DMA_SCFGx_PRILCFG               /*!< Priority level : Very_High */
#else
#define DDL_DMA_PRIORITY_MEDIUM            DMA_CHCFG_CHPL_0                /*!< Priority level : Medium    */
#define DDL_DMA_PRIORITY_HIGH              DMA_CHCFG_CHPL_1                /*!< Priority level : High      */
#define DDL_DMA_PRIORITY_VERYHIGH          DMA_CHCFG_CHPL                  /*!< Priority level : Very_High */
#endif /* DMA_SCFGx_PRILCFG */
/**
  * @}
  */

