betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dma.h
/** @defgroup DMA_DDL_EC_CHANNEL CHANNEL
  * @{
  */
#if defined (DMA_SCFGx_CHSEL)
#define DDL_DMA_CHANNEL_0                  0x00000000U                                                                       /* Select Channel0 of DMA Instance */
#define DDL_DMA_CHANNEL_1                  DMA_SCFGx_CHSEL_0                                                                 /* Select Channel1 of DMA Instance */
#define DDL_DMA_CHANNEL_2                  DMA_SCFGx_CHSEL_1                                                                 /* Select Channel2 of DMA Instance */
#define DDL_DMA_CHANNEL_3                  (DMA_SCFGx_CHSEL_0 | DMA_SCFGx_CHSEL_1)                                           /* Select Channel3 of DMA Instance */
#define DDL_DMA_CHANNEL_4                  DMA_SCFGx_CHSEL_2                                                                 /* Select Channel4 of DMA Instance */
#define DDL_DMA_CHANNEL_5                  (DMA_SCFGx_CHSEL_2 | DMA_SCFGx_CHSEL_0)                                           /* Select Channel5 of DMA Instance */
#define DDL_DMA_CHANNEL_6                  (DMA_SCFGx_CHSEL_2 | DMA_SCFGx_CHSEL_1)                                           /* Select Channel6 of DMA Instance */
#define DDL_DMA_CHANNEL_7                  (DMA_SCFGx_CHSEL_2 | DMA_SCFGx_CHSEL_1 | DMA_SCFGx_CHSEL_0)                       /* Select Channel7 of DMA Instance */
#if defined (DMA_SCFGx_CHSEL_3)
#define DDL_DMA_CHANNEL_8                  DMA_SCFGx_CHSEL_3                                                                 /* Select Channel8 of DMA Instance */
#define DDL_DMA_CHANNEL_9                  (DMA_SCFGx_CHSEL_3 | DMA_SCFGx_CHSEL_0)                                           /* Select Channel9 of DMA Instance */
#define DDL_DMA_CHANNEL_10                 (DMA_SCFGx_CHSEL_3 | DMA_SCFGx_CHSEL_1)                                           /* Select Channel10 of DMA Instance */
#define DDL_DMA_CHANNEL_11                 (DMA_SCFGx_CHSEL_3 | DMA_SCFGx_CHSEL_1 | DMA_SCFGx_CHSEL_0)                       /* Select Channel11 of DMA Instance */
#define DDL_DMA_CHANNEL_12                 (DMA_SCFGx_CHSEL_3 | DMA_SCFGx_CHSEL_2)                                           /* Select Channel12 of DMA Instance */
#define DDL_DMA_CHANNEL_13                 (DMA_SCFGx_CHSEL_3 | DMA_SCFGx_CHSEL_2 | DMA_SCFGx_CHSEL_0)                       /* Select Channel13 of DMA Instance */
#define DDL_DMA_CHANNEL_14                 (DMA_SCFGx_CHSEL_3 | DMA_SCFGx_CHSEL_2 | DMA_SCFGx_CHSEL_1)                       /* Select Channel14 of DMA Instance */
#define DDL_DMA_CHANNEL_15                 (DMA_SCFGx_CHSEL_3 | DMA_SCFGx_CHSEL_2 | DMA_SCFGx_CHSEL_1 | DMA_SCFGx_CHSEL_0)   /* Select Channel15 of DMA Instance */
#endif /* DMA_SCFGx_CHSEL_3 */
#endif /* DMA_SCFGx_CHSEL */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_MBURST MBURST
  * @{
  */
#if defined (DMA_SCFGx_MBCFG)
#define DDL_DMA_MBURST_SINGLE              0x00000000U                             /*!< Memory burst single transfer configuration */
#define DDL_DMA_MBURST_INC4                DMA_SCFGx_MBCFG_0                       /*!< Memory burst of 4 beats transfer configuration */
#define DDL_DMA_MBURST_INC8                DMA_SCFGx_MBCFG_1                       /*!< Memory burst of 8 beats transfer configuration */
#define DDL_DMA_MBURST_INC16               (DMA_SCFGx_MBCFG_0 | DMA_SCFGx_MBCFG_1) /*!< Memory burst of 16 beats transfer configuration */
#endif /* DMA_SCFGx_MBCFG */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_PBURST PBURST
  * @{
  */
#if defined (DMA_SCFGx_PBCFG)
#define DDL_DMA_PBURST_SINGLE              0x00000000U                             /*!< Peripheral burst single transfer configuration */
#define DDL_DMA_PBURST_INC4                DMA_SCFGx_PBCFG_0                       /*!< Peripheral burst of 4 beats transfer configuration */
#define DDL_DMA_PBURST_INC8                DMA_SCFGx_PBCFG_1                       /*!< Peripheral burst of 8 beats transfer configuration */
#define DDL_DMA_PBURST_INC16               (DMA_SCFGx_PBCFG_0 | DMA_SCFGx_PBCFG_1) /*!< Peripheral burst of 16 beats transfer configuration */
#endif /* DMA_SCFGx_PBCFG */
/**
  * @}
  */

/** @defgroup DMA_DDL_FIFOMODE DMA_DDL_FIFOMODE
  * @{
  */
#if defined (DMA_FCTRLx_DMDEN)
#define DDL_DMA_FIFOMODE_DISABLE           0x00000000U                             /*!< FIFO mode disable (direct mode is enabled) */
#define DDL_DMA_FIFOMODE_ENABLE            DMA_FCTRLx_DMDEN                        /*!< FIFO mode enable  */
#endif /* DMA_FCTRLx_DMDEN */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_FIFOSTATUS_0 FIFOSTATUS 0
  * @{
  */
#if defined (DMA_FCTRLx_FSTS)
#define DDL_DMA_FIFOSTATUS_0_25            0x00000000U                                /*!< 0 < fifo_level < 1/4    */
#define DDL_DMA_FIFOSTATUS_25_50           DMA_FCTRLx_FSTS_0                          /*!< 1/4 < fifo_level < 1/2  */
#define DDL_DMA_FIFOSTATUS_50_75           DMA_FCTRLx_FSTS_1                          /*!< 1/2 < fifo_level < 3/4  */
#define DDL_DMA_FIFOSTATUS_75_100          (DMA_FCTRLx_FSTS_1 | DMA_FCTRLx_FSTS_0)    /*!< 3/4 < fifo_level < full */
#define DDL_DMA_FIFOSTATUS_EMPTY           DMA_FCTRLx_FSTS_2                          /*!< FIFO is empty           */
#define DDL_DMA_FIFOSTATUS_FULL            (DMA_FCTRLx_FSTS_2 | DMA_FCTRLx_FSTS_0)    /*!< FIFO is full            */
#endif /* DMA_FCTRLx_FSTS */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_FIFOTHRESHOLD FIFOTHRESHOLD
  * @{
  */
#if defined (DMA_FCTRLx_FTHSEL)
#define DDL_DMA_FIFOTHRESHOLD_1_4          0x00000000U                             /*!< FIFO threshold 1 quart full configuration  */
#define DDL_DMA_FIFOTHRESHOLD_1_2          DMA_FCTRLx_FTHSEL_0                     /*!< FIFO threshold half full configuration     */
#define DDL_DMA_FIFOTHRESHOLD_3_4          DMA_FCTRLx_FTHSEL_1                     /*!< FIFO threshold 3 quarts full configuration */
#define DDL_DMA_FIFOTHRESHOLD_FULL         DMA_FCTRLx_FTHSEL                       /*!< FIFO threshold full configuration          */
#endif /* DMA_FCTRLx_FTHSEL */
/**
  * @}
  */

/** @defgroup DMA_DDL_EC_CURRENTTARGETMEM CURRENTTARGETMEM
  * @{
  */
#if defined (DMA_SCFGx_CTARG)
#define DDL_DMA_CURRENTTARGETMEM0          0x00000000U                             /*!< Set CurrentTarget Memory to Memory 0  */
#define DDL_DMA_CURRENTTARGETMEM1          DMA_SCFGx_CTARG                             /*!< Set CurrentTarget Memory to Memory 1  */
#endif /* DMA_SCFGx_CTARG */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/
/** @defgroup DMA_DDL_Exported_Macros DMA Exported Macros
  * @{
  */

