betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Include/apm32f4xx_ddl_dma.h
/**
  * @brief  Get Channel 6 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_DMA_IsActiveFlag_TE6(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->INTSTS ,DMA_INTSTS_TERRFLG6)==(DMA_INTSTS_TERRFLG6));
}

/**
  * @brief  Get Channel 7 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t DDL_DMA_IsActiveFlag_TE7(DMA_TypeDef *DMAx)
{
  return (READ_BIT(DMAx->INTSTS ,DMA_INTSTS_TERRFLG7)==(DMA_INTSTS_TERRFLG7));
}

/**
  * @brief  Clear Channel 1 global interrupt flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_GI1(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR, DMA_INTFCLR_GINTCLR1);
}

/**
  * @brief  Clear Channel 2 global interrupt flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_GI2(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR, DMA_INTFCLR_GINTCLR2);
}

/**
  * @brief  Clear Channel 3 global interrupt flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_GI3(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR, DMA_INTFCLR_GINTCLR3);
}

/**
  * @brief  Clear Channel 4 global interrupt flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_GI4(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR, DMA_INTFCLR_GINTCLR4);
}

/**
  * @brief  Clear Channel 5 global interrupt flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_GI5(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR, DMA_INTFCLR_GINTCLR5);
}

/**
  * @brief  Clear Channel 6 global interrupt flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_GI6(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR, DMA_INTFCLR_GINTCLR6);
}

/**
  * @brief  Clear Channel 7 global interrupt flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_GI7(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR, DMA_INTFCLR_GINTCLR7);
}

/**
  * @brief  Clear Channel 1 transfer complete flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TC1(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TCCLR1);
}

/**
  * @brief  Clear Channel 2 transfer complete flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TC2(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TCCLR2);
}

/**
  * @brief  Clear Channel 3 transfer complete flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TC3(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TCCLR3);
}

/**
  * @brief  Clear Channel 4 transfer complete flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TC4(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TCCLR4);
}

/**
  * @brief  Clear Channel 5 transfer complete flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TC5(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TCCLR5);
}

/**
  * @brief  Clear Channel 6 transfer complete flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TC6(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TCCLR6);
}

/**
  * @brief  Clear Channel 7 transfer complete flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TC7(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TCCLR7);
}

/**
  * @brief  Clear Channel 1 half transfer flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_HT1(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_HTCLR1);
}

/**
  * @brief  Clear Channel 2 half transfer flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_HT2(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_HTCLR2);
}

/**
  * @brief  Clear Channel 3 half transfer flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_HT3(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_HTCLR3);
}

/**
  * @brief  Clear Channel 4 half transfer flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_HT4(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_HTCLR4);
}

/**
  * @brief  Clear Channel 5 half transfer flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_HT5(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_HTCLR5);
}

/**
  * @brief  Clear Channel 6 half transfer flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_HT6(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_HTCLR6);
}

/**
  * @brief  Clear Channel 7 half transfer flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_HT7(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_HTCLR7);
}

/**
  * @brief  Clear Channel 1 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TE1(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TERRCLR1);
}

/**
  * @brief  Clear Channel 2 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TE2(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TERRCLR2);
}

/**
  * @brief  Clear Channel 3 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TE3(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TERRCLR3);
}

/**
  * @brief  Clear Channel 4 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TE4(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TERRCLR4);
}

/**
  * @brief  Clear Channel 5 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TE5(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TERRCLR5);
}

/**
  * @brief  Clear Channel 6 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TE6(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TERRCLR6);
}

/**
  * @brief  Clear Channel 7 transfer error flag.
  * @param  DMAx DMAx Instance
  * @retval None
  */
__STATIC_INLINE void DDL_DMA_ClearFlag_TE7(DMA_TypeDef *DMAx)
{
  WRITE_REG(DMAx->INTFCLR , DMA_INTFCLR_TERRCLR7);
}

/**
  * @}
  */

